Gets the secondary adjacent analytical space this surface is associated with.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public EnergyAnalysisSpace GetAdjacentAnalyticalSpace()
  Visual Basic
Public Function GetAdjacentAnalyticalSpace As EnergyAnalysisSpace
  Visual C++
public:
EnergyAnalysisSpace^ GetAdjacentAnalyticalSpace()
 Return Value
 The secondary analytical space.
 Remarks
 An exterior surface will only have one space adjacency.
 See Also
  EnergyAnalysisSurface Class
  Autodesk.Revit.DB.Analysis Namespace